;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #2F checkDirExist
;---------------------------------------
; Проверить существует ли катала в активной директории 
; i:HL - имя каталога(1-12),#00
; o:NZ - каталог существует
;    Z - каталог не найден
;---------------------------------------
_checkDirExist	ld	a,flagDir				; directory
_checkDirExist_	call	prepareEntry
		jp	eSearch
;---------------------------------------
