;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #2E checkFileExist
;---------------------------------------
; Проверить существует ли файл в активной директории
; i:HL - имя файла(1-12),#00
; o:NZ - файл существует
;    Z - файл не найден
;---------------------------------------
_checkFileExist	ld	a,flagFile				; file
		jr	_checkDirExist_
;---------------------------------------
