;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #56 disableNvram
;---------------------------------------
; Запретить работу с Nvram (опрос клавиатуры не будет работать)
;---------------------------------------
_disableNvram	push	af
		ld	a,#01					; Запретить вызов обработчика клавиатуры
		ld	(disableKeyboard+1),a
		call	_nvRamClose
		pop	af
		ret
;---------------------------------------
