;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #59 enableAyPlay
;---------------------------------------
; Разрешить воспроизведение AY. Данные должны быть предварительно
; загружены в ayBank и проинициализированы драйвером с помощью pt3init
;---------------------------------------
_enableAyPlay	halt
		ld	a,#01
		ld	(enableAy+1),a
		ret
;---------------------------------------
