;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #55 enableNvram
;---------------------------------------
; Разрешить работу с Nvram (использует опрос клавиатуры на прерывании)
;---------------------------------------
_enableNvram	push 	af
		call	_nvRamOpen
		xor	a					; Разрешить вызов обработчика клавиатуры
		ld	(disableKeyboard+1),a
		pop	af
		ret
;---------------------------------------
