;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #48 getHexFromParams
;---------------------------------------
; Получить число (шеснадцатиричное) (#AB) из строки параметров
; i: DE - адрес начала строки
; o: H=0,L - значение (число)
;    DE - адрес продолжения строки
;     A = #ff - ошибка (не число)
;---------------------------------------
_getHexFromParams
		call	_eatSpaces
		ld	a,(de)
		cp	"#"
		jr	nz,getHexError
		inc	de
		jp	_hex2int
;---------------------------------------
