;---------------------------------------
; CLi² (Command Line Interface) API
; 2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #41 getRamAlloc
;---------------------------------------
; Возвращает номер банки памяти, в которой расположены данные
; i: A' - ID данных:
;         #00 - 0й тектовый экран (ALT+F1)
;         #01 - 1й графический экран (ALT+F2)
;         #02 - 2й графический экран (ALT+F3)
;         #03 - 3й графический экран (ALT+F4)
;
;         #FF - …
; o: A - номер банки, с которой начинается данные
;---------------------------------------
_getRamAlloc	ex	af,af'
		ld	hl,memAllocData
		ld	b,#00
		ld	c,a
		add	hl,bc
		ld 	a,(hl)
		ret
;---------------------------------------
