;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #24 loadFileLimit
;---------------------------------------
; Загрузить файл по указанному адресу, предварительно проверив его размер
;  i: HL - адрес строки именем файла (или путём до него)
;     DE - адрес загрузки файла
;     BC - размер проверяемого файла
;  o: A = #ff ошибка, A' = код ошибки
;---------------------------------------
_loadFileLimit	ld	a,#01					; bc - лимит
		ld	(checkLimit+1),a
		ld	a,b
		ld	(checkLimit_01+1),a
		ld	a,c
		ld	(checkLimit_02+1),a
		jp	_loadFile0
;---------------------------------------
