;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #1F printCodeDisable
;---------------------------------------
; Запретить(1) / Разрешить(0) печать управляющих символов (кроме #0d/#0a)
;  i: B - значение
;---------------------------------------
_printCodeDisable
		ld	a,b
		ld	(printFixCode+1),a			; запретить (1), разрешить (0) печать управляющих символов (кроме #0d #0a)
		ret
;---------------------------------------
