;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #20 printWithScroll
;---------------------------------------
; Спрашивать ли «Scroll?» при печати 30 строк за раз
;  i: B - значение: Разрешить(1) / Запретить(0)
;---------------------------------------
_printWithScroll
		ld	a,b
		ld	(printScrollEnable+1),a			; разрешить (1) / запретить (0) спрашивать Scroll при выводе теста
		ret
;---------------------------------------
