;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #4F ps2ResetKeyboard
;---------------------------------------
; Переинициализировать клавиатуру (сброс при переполнении буфера)
;---------------------------------------
_ps2ResetKeyboard
		ld	a,#0c
		call	_nvRamGetData
		and	%00000010				; 1-й бит сохраняем статус Caps Lock
		or	%00000001				; 0-й бит cброс буфера клавиатуры
_ps2ResKbd	ex	af,af'
		ld	a,#0c
		call	_nvRamSetData
		ret
;---------------------------------------
