;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #0A setScreenOffsetX
;---------------------------------------
; Установить смещение для графического экрана по оси X
; i:HL - смещение (0-511)
;   B - номер графического экрана (1/2/3)
;---------------------------------------
_setScreenOffsetX
		ex	de,hl
		ld	a,b				; у нас свой скрин
		call	getCurScrXToHL_
		jp	setDEToAddrHL
;---------------------------------------
