;---------------------------------------
; CLi² (Command Line Interface) API
; 2013,2016 © breeze/fishbone crew
;---------------------------------------
; MODULE: #0B setScreenOffsetY
;---------------------------------------
; Установить смещение для графического экрана по оси Y
; i:HL - смещение (0-287)
;   B - номер графического экрана (1/2/3)
;---------------------------------------
_setScreenOffsetY
		ex	de,hl
		ld	a,b				; у нас свой скрин
		call	getCurScrYToHL_
		jp	setDEToAddrHL
;---------------------------------------
