;---------------------------------------
; CLi² (Command Line Interface) Alt Gray Coder
; 2016 © breeze/fishbone crew
;---------------------------------------
; коды ASCII для маппинга сочитания AltGr +
;---------------------------------------
bTL			equ	#DA			; ┌ тонкая рамка вверх-лево
bT			equ	#C2			; ┬ тонкая рамка вверх
bTR			equ	#BF			; ┐ тонкая рамка вверх-право
bML			equ	#C3			; ├ тонкая рамка середина-лево
bM			equ	#C5			; ┼ тонкая рамка середина
bMR			equ	#B4			; ┤ тонкая рамка середина-право
bBL			equ	#C0			; └ тонкая рамка низ-лево
bB			equ	#C1			; ┴ тонкая рамка низ
bBR			equ	#D9			; ┘ тонкая рамка низ-право

dTL			equ	#C9			; ╔ двойная рамка вверх-лево
dT			equ	#CB			; ╦ двойная рамка вверх
dTR			equ	#BB			; ╗ двойная рамка вверх-право
dML			equ	#CC			; ╠ двойная рамка середина-лево
dM			equ	#CE			; ╬ двойная рамка середина
dMR			equ	#B9			; ╣ двойная рамка середина-право
dBL			equ	#C8			; ╚ двойная рамка низ-лево
dB			equ	#CA			; ╩ двойная рамка низ
dBR			equ	#BC			; ╝ двойная рамка низ-право

elO			equ	#F3			; « ёлочки
elC			equ	#F2			; » ёлочки
tre			equ	#FE			; … троеточие

st2			equ	#FD			; ² степень
num			equ	#FC			; № знак номер
st0			equ	#F8			; ° знак градус

inU			equ	#F4			; ⌠ мат. верхний интеграл
inD			equ	#F5			; ⌡ мат. нижний интеграл

del			equ	#F6			; ÷ мат. деленение
apx			equ	#F7			; ≈ мат. приблизительно

